Revit 2027 API
SaveOptions Constructor
 Default constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SaveOptions()
Public Sub New
public:
SaveOptions()
new : unit -> SaveOptions
Remarks
 PreviewViewId will be InvalidElementId.
See Also
Reference
SaveOptions Class
Autodesk.Revit.DB Namespace